logs/fio-diskrnd/Strato 4v 8GB/000/log005.txt
+ mkdir -p tmp
+ cd tmp
+ fio --rw=randwrite --name=kube-fio-write --output-format=normal,terse --bs=256k --size=16G
kube-fio-write: (g=0): rw=randwrite, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;16777216;521906;2038;32146;0;0;0.000000;0.000000;69;47416;481.900095;2171.591983;1.000000%=72;5.000000%=74;10.000000%=75;20.000000%=77;30.000000%=79;40.000000%=84;50.000000%=89;60.000000%=95;70.000000%=110;80.000000%=120;90.000000%=140;95.000000%=166;99.000000%=13434;99.500000%=13697;99.900000%=14483;99.950000%=14745;99.990000%=16318;0%=0;0%=0;0%=0;70;47422;483.928567;2171.565645;475136;1968640;100.000000%;522264.000000;190781.592696;0.895940%;21.032820%;2132;0;11;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;63.62%;33.13%;0.14%;0.01%;0.01%;0.01%;0.00%;0.61%;2.49%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;0;45384;0;82;0;1507906;1507909;97.86%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=3859: Mon Jan  8 14:18:54 2024
  write: IOPS=2038, BW=510MiB/s (534MB/s)(16.0GiB/32146msec); 0 zone resets
    clat (usec): min=69, max=47416, avg=481.90, stdev=2171.59
     lat (usec): min=70, max=47422, avg=483.93, stdev=2171.57
    clat percentiles (usec):
     |  1.00th=[   73],  5.00th=[   75], 10.00th=[   76], 20.00th=[   78],
     | 30.00th=[   80], 40.00th=[   85], 50.00th=[   90], 60.00th=[   96],
     | 70.00th=[  111], 80.00th=[  121], 90.00th=[  141], 95.00th=[  167],
     | 99.00th=[13435], 99.50th=[13698], 99.90th=[14484], 99.95th=[14746],
     | 99.99th=[16319]
   bw (  KiB/s): min=475136, max=1968640, per=100.00%, avg=522264.00, stdev=190781.59, samples=64
   iops        : min= 1856, max= 7690, avg=2040.09, stdev=745.24, samples=64
  lat (usec)   : 100=63.62%, 250=33.13%, 500=0.14%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 10=0.61%, 20=2.49%, 50=0.01%
  cpu          : usr=0.90%, sys=21.03%, ctx=2132, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,65536,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=510MiB/s (534MB/s), 510MiB/s-510MiB/s (534MB/s-534MB/s), io=16.0GiB (17.2GB), run=32146-32146msec

Disk stats (read/write):
  vda: ios=0/45384, merge=0/82, ticks=0/1507906, in_queue=1507909, util=97.86%
+ fio --rw=randread --name=kube-fio-read --output-format=normal,terse --bs=256k --size=16G
kube-fio-read: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-read;0;0;16777216;483925;1890;34669;0;0;0.000000;0.000000;226;7274;521.255673;67.311142;1.000000%=333;5.000000%=436;10.000000%=456;20.000000%=477;30.000000%=497;40.000000%=514;50.000000%=522;60.000000%=528;70.000000%=544;80.000000%=569;90.000000%=585;95.000000%=602;99.000000%=675;99.500000%=708;99.900000%=815;99.950000%=946;99.990000%=1695;0%=0;0%=0;0%=0;226;7274;521.375724;67.305642;135680;539648;100.000000%;484233.275362;43019.574458;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.467290%;17.295489%;65597;0;73;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.03%;31.65%;68.11%;0.16%;0.03%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;65478;3025;0;6;28636;66563;95200;100.00%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=3862: Mon Jan  8 14:19:29 2024
  read: IOPS=1890, BW=473MiB/s (496MB/s)(16.0GiB/34669msec)
    clat (usec): min=226, max=7274, avg=521.26, stdev=67.31
     lat (usec): min=226, max=7274, avg=521.38, stdev=67.31
    clat percentiles (usec):
     |  1.00th=[  334],  5.00th=[  437], 10.00th=[  457], 20.00th=[  478],
     | 30.00th=[  498], 40.00th=[  515], 50.00th=[  523], 60.00th=[  529],
     | 70.00th=[  545], 80.00th=[  570], 90.00th=[  586], 95.00th=[  603],
     | 99.00th=[  676], 99.50th=[  709], 99.90th=[  816], 99.95th=[  947],
     | 99.99th=[ 1696]
   bw (  KiB/s): min=135680, max=539648, per=100.00%, avg=484233.28, stdev=43019.57, samples=69
   iops        : min=  530, max= 2108, avg=1891.54, stdev=168.05, samples=69
  lat (usec)   : 250=0.03%, 500=31.65%, 750=68.11%, 1000=0.16%
  lat (msec)   : 2=0.03%, 4=0.01%, 10=0.01%
  cpu          : usr=0.47%, sys=17.30%, ctx=65597, majf=0, minf=73
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=65536,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=473MiB/s (496MB/s), 473MiB/s-473MiB/s (496MB/s-496MB/s), io=16.0GiB (17.2GB), run=34669-34669msec

Disk stats (read/write):
  vda: ios=65478/3025, merge=0/6, ticks=28636/66563, in_queue=95200, util=100.00%