logs/fio-diskrnd/Strato 4v 8GB/000/log007.txt
+ mkdir -p tmp
+ cd tmp
+ fio --rw=randwrite --name=kube-fio-write --output-format=normal,terse --bs=256k --size=16G
kube-fio-write: (g=0): rw=randwrite, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;16777216;522020;2039;32139;0;0;0.000000;0.000000;68;40787;482.220701;2190.695045;1.000000%=70;5.000000%=72;10.000000%=73;20.000000%=75;30.000000%=78;40.000000%=83;50.000000%=87;60.000000%=94;70.000000%=108;80.000000%=117;90.000000%=134;95.000000%=156;99.000000%=13565;99.500000%=13697;99.900000%=14352;99.950000%=14745;99.990000%=17432;0%=0;0%=0;0%=0;69;40789;484.091336;2190.657668;474624;1924096;100.000000%;522360.000000;187141.022146;0.500965%;20.748024%;2092;0;13;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;65.12%;31.72%;0.05%;0.01%;0.00%;0.01%;0.00%;0.55%;2.55%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;0;45139;0;80;0;1495958;1495960;97.86%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=3895: Mon Jan  8 14:21:29 2024
  write: IOPS=2039, BW=510MiB/s (535MB/s)(16.0GiB/32139msec); 0 zone resets
    clat (usec): min=68, max=40787, avg=482.22, stdev=2190.70
     lat (usec): min=69, max=40789, avg=484.09, stdev=2190.66
    clat percentiles (usec):
     |  1.00th=[   71],  5.00th=[   73], 10.00th=[   74], 20.00th=[   76],
     | 30.00th=[   79], 40.00th=[   84], 50.00th=[   88], 60.00th=[   95],
     | 70.00th=[  109], 80.00th=[  118], 90.00th=[  135], 95.00th=[  157],
     | 99.00th=[13566], 99.50th=[13698], 99.90th=[14353], 99.95th=[14746],
     | 99.99th=[17433]
   bw (  KiB/s): min=474624, max=1924096, per=100.00%, avg=522360.00, stdev=187141.02, samples=64
   iops        : min= 1854, max= 7516, avg=2040.47, stdev=731.02, samples=64
  lat (usec)   : 100=65.12%, 250=31.72%, 500=0.05%, 750=0.01%
  lat (msec)   : 2=0.01%, 10=0.55%, 20=2.55%, 50=0.01%
  cpu          : usr=0.50%, sys=20.75%, ctx=2092, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,65536,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=510MiB/s (535MB/s), 510MiB/s-510MiB/s (535MB/s-535MB/s), io=16.0GiB (17.2GB), run=32139-32139msec

Disk stats (read/write):
  vda: ios=0/45139, merge=0/80, ticks=0/1495958, in_queue=1495960, util=97.86%
+ fio --rw=randread --name=kube-fio-read --output-format=normal,terse --bs=256k --size=16G
kube-fio-read: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-read;0;0;16777216;484232;1891;34647;0;0;0.000000;0.000000;217;2720;521.147397;63.230412;1.000000%=333;5.000000%=436;10.000000%=456;20.000000%=477;30.000000%=497;40.000000%=514;50.000000%=522;60.000000%=528;70.000000%=544;80.000000%=569;90.000000%=585;95.000000%=602;99.000000%=667;99.500000%=700;99.900000%=872;99.950000%=1155;99.990000%=1974;0%=0;0%=0;0%=0;217;2720;521.291597;63.223100;160256;537600;100.000000%;484589.449275;40056.441462;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.441609%;17.600877%;65606;0;73;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.15%;31.79%;67.82%;0.18%;0.05%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;65520;3016;0;5;28686;66592;95279;100.00%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=3898: Mon Jan  8 14:22:04 2024
  read: IOPS=1891, BW=473MiB/s (496MB/s)(16.0GiB/34647msec)
    clat (usec): min=217, max=2720, avg=521.15, stdev=63.23
     lat (usec): min=217, max=2720, avg=521.29, stdev=63.22
    clat percentiles (usec):
     |  1.00th=[  334],  5.00th=[  437], 10.00th=[  457], 20.00th=[  478],
     | 30.00th=[  498], 40.00th=[  515], 50.00th=[  523], 60.00th=[  529],
     | 70.00th=[  545], 80.00th=[  570], 90.00th=[  586], 95.00th=[  603],
     | 99.00th=[  668], 99.50th=[  701], 99.90th=[  873], 99.95th=[ 1156],
     | 99.99th=[ 1975]
   bw (  KiB/s): min=160256, max=537600, per=100.00%, avg=484589.45, stdev=40056.44, samples=69
   iops        : min=  626, max= 2100, avg=1892.93, stdev=156.47, samples=69
  lat (usec)   : 250=0.15%, 500=31.79%, 750=67.82%, 1000=0.18%
  lat (msec)   : 2=0.05%, 4=0.01%
  cpu          : usr=0.44%, sys=17.60%, ctx=65606, majf=0, minf=73
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=65536,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=473MiB/s (496MB/s), 473MiB/s-473MiB/s (496MB/s-496MB/s), io=16.0GiB (17.2GB), run=34647-34647msec

Disk stats (read/write):
  vda: ios=65520/3016, merge=0/5, ticks=28686/66592, in_queue=95279, util=100.00%